In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import random

In [4]:
data = pd.read_csv('tags.csv')

In [5]:
data.shape

(465564, 4)

In [6]:
data.head()

   userId  movieId            tag   timestamp
0      18     4141    Mark Waters  1240597180
1      65      208      dark hero  1368150078
2      65      353      dark hero  1368150079
3      65      521  noir thriller  1368149983
4      65      592      dark hero  1368150078

In [7]:
data = data.drop(columns = ['timestamp'])

In [8]:
data.head()

   userId  movieId            tag
0      18     4141    Mark Waters
1      65      208      dark hero
2      65      353      dark hero
3      65      521  noir thriller
4      65      592      dark hero

In [9]:
tags_set = data['tag'].unique()

In [10]:
tags_set.shape

(38644,)

In [11]:
data.userId.unique().shape

(7801,)

In [12]:
data.movieId.unique().shape

(19545,)

In [13]:
pos_dict = dict()
for uid, mid, tag in data.values:
    if (uid, mid) not in pos_dict:
        pos_dict[(uid, mid)] = set()
    pos_dict[(uid, mid)].add(tag)

In [14]:
neg_dict = {}
for uid, mid in pos_dict:
    k = random.randint(0,5)
    pos_num = len(pos_dict[(uid,mid)])
    neg_num = pos_num * k
    pos_tags = np.random.choice(tags_set, neg_num)
    neg_dict[(uid,mid)] = set(set(pos_tags) - pos_dict[(uid, mid)])

In [15]:
neg_dict[(18,4141)]

{'12.28.08',
 'Georege Lucas',
 'Theodore J. Flicker',
 'a bit boring',
 'cross dressing women'}

In [16]:
neg_df_dict = {'userId':[], 'movieId': [], 'tag':[]}
for uid, mid in neg_dict:
    for tag in neg_dict[(uid,mid)]:
        neg_df_dict['userId'].append(uid)
        neg_df_dict['movieId'].append(mid)
        neg_df_dict['tag'].append(tag)

In [17]:
neg_df = pd.DataFrame(neg_df_dict)

In [18]:
neg_df.head()

   userId  movieId                   tag
0      18     4141              12.28.08
1      18     4141          a bit boring
2      18     4141         Georege Lucas
3      18     4141  cross dressing women
4      18     4141   Theodore J. Flicker

In [19]:
data['label'] = 1
neg_df['label'] = 0

In [20]:
data.head()

   userId  movieId            tag  label
0      18     4141    Mark Waters      1
1      65      208      dark hero      1
2      65      353      dark hero      1
3      65      521  noir thriller      1
4      65      592      dark hero      1

In [21]:
all_data = data.append(neg_df).reset_index(drop=True)

In [22]:
all_data.head()

   userId  movieId            tag  label
0      18     4141    Mark Waters      1
1      65      208      dark hero      1
2      65      353      dark hero      1
3      65      521  noir thriller      1
4      65      592      dark hero      1

In [23]:
all_data = all_data.sample(frac=1).reset_index(drop=True)

In [24]:
all_data = all_data.sample(frac=1).reset_index(drop=True)

In [25]:
all_data.head()

   userId  movieId                     tag  label
0   20799      954         black and white      1
1  124998   103384  I wish I could do that      0
2  107711    69122               Las Vegas      1
3  123297     1292               hyperbole      0
4   40008     2706                groupies      0

In [26]:
all_data.to_csv('data.csv',header=True,index=False)

In [27]:
all_data.shape

(1631812, 4)